Data Duplication Removal from Dataset Using Python

Identifying Duplicates

In [3]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob', 'David'],
    'Age': [25, 30, 25, 35, 30, 40],
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'San Francisco']
}

df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
2    Alice   25       New York
3  Charlie   35        Chicago
4      Bob   30    Los Angeles
5    David   40  San Francisco

1. Using duplicated() Method
The duplicated() method helps to identify duplicate rows in a dataset. It returns a boolean Series indicating whether a row is a duplicate of a previous row.

In [6]:
duplicates = df.duplicated()

duplicates

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

Removing Duplicates

1. Based on Specific Columns
Here we will specify columns i.e name and city to remove duplicates using drop_duplicates() .

In [10]:
df_no_duplicates_columns = df.drop_duplicates(subset=['Name', 'City'])
(df_no_duplicates_columns)

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
3  Charlie   35        Chicago
5    David   40  San Francisco

2. Keeping the First or Last Occurrence
By default drop_duplicates() keeps the first occurrence of each duplicate row. However, we can adjust it to keep the last occurrence instead.

In [22]:
df_keep_last = df.drop_duplicates()
(df_keep_last)

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
3  Charlie   35        Chicago
5    David   40  San Francisco

In [24]:
df_keep_last = df.drop_duplicates(keep='last')
(df_keep_last)

      Name  Age           City
2    Alice   25       New York
3  Charlie   35        Chicago
4      Bob   30    Los Angeles
5    David   40  San Francisco